<?php

namespace App\Console\Commands;

use Illuminate\Console\Command;
use Illuminate\Support\Facades\DB;
use Modules\Setting\Entities\Setting;

class InitSettingsCommand extends Command
{
    //    <li>کنسلی کمتر از 24 ساعت قبل از ورود مهمان مصادف با 100 درصد جریمه است.</li>
//	<li>رعایت نظم در محیط کافه و رستوران الزامی است.</li>
//	<li>رعایت حجاب اسلامی در محیط کافه و رستوران الزامی است.</li>

    const SETTINGS = [
        'about_us_page' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
        'about_us' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
        'contact_us' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
        'website_terms_text' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
        'app_terms_text' => "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.",
        'introduction' => 'سامانه رزرو میز ، امکانی را در اختیار کاربران قرار می دهد که با استفاده از تورمجازی (تصاویر 360 درجه) در کافه ها و رستوران ها گشت و گذار داشته باشند تا هم با محیط کافه و رستوران ها آشنا شوند و هم بتوانند میز مورد نظر خود را با استفاده از تورمجازی انتخاب و برای تاریخی مشخص رزرو نمایند.',
        'reserve_restaurant_terms' => "<ul>
	                    <li>۱.در وقت تعیین شده در محل حضور داشته باشید.</li>
                                        <li>۲.میزتا ۱۵ دقیقه تاخیر رزرو می‌ماند </li>
                                        <li>۳.هزینه رزرو عودت داده نمی‌شود</li>
                                        <li>۴.جهت برگزاری مراسمات(تولدو...)حضوری به محل مراجعه کنید.</li>
                                        <li>۵.زمان تقریبی حضور ۲ ساعت در نظر گرفته شده در صورت استفاده بیشتر با مدیریت کافه رستوران هماهنگ کنید</li>
</ul>",
        'reserve_hotel_terms' => "<ul>
    <li>خردسال زیر ۲ سال رایگان</li>
	<li>لغو تا ۲۴ ساعت کل هزینه یک شب </li>
	<li>لغو تا ۴۸ساعت ۵۰ درصد یک شب</li>
	<li>لغوتا ۷۲ ساعت ۳۰ درصد</li>
	<li>پذیرش زوج فقط با مدارک محرمیت</li>
</ul>",
        'banner_title' => "سامانه رزرواسیون بامیز",
        'banner_description' => "کافه و رستوران یا هتل خود را جهت مشاهده تورمجازی و رزرو آنلاین جستجو نمائید",
        'banner_image' => "/front/img/intro_banner.jpg",
        'banner_video_mp4' => "/front/video/intro_gif.mp4",
        'banner_video_ogv' => "/front/video/intro_gif.mp4",
        'copyright' => "کپی رایت بامیز",
        'logo' => "/front/img/logo_sticky.svg",
        'address' => "قزوین - باراجین - پارک علم و فناوری",
        'phone' => "09031770113",
        'manager_phone_1' => "09031770113",
        'manager_phone_2' => "09396988720",
        'contact_us_phone' => "+989396988720",
        'about_us_title' => "بامیز سایت رزرو آنلاین کافه و رستوران و هتل",
        'about_us_text' => "ما درسامانه رزرواسیون بامیز در راستای پیشرفت و بروز شدن سیستم های مدیریت کافه رستوران ها وهتل ها،با امکاناتی نظیر:
 ۱.تولید محتوا  ۲. سیستم رزرواسیون مراکز  ۳.  تور مجازی ، ۴.  ساخت صفحه اختصاصی مراکز،
در تلاشیم که شرایطی فراهم کنیم تا هم وطنان عزیز در شهر خود یا در مسافرت بهترین مراکز را با شناخت کامل از :
۱.محیط کافه رستوران یا هتل(با تور مجازی)
۲.قیمت
۳،موقعیت مکانی
۴.اطلاعات و لوکیشن
۵.تشریفات
۶.نظر سنجی
و صرفه جویی در زمان در مراکز مربوطه گشت بزنند، انتخاب کرده ورزرو نمایند.
<a href='http://bamiz.ir'>www.bamiz.ir</a>",
        'default_site_admin' => "مدیریت بامیز",
        'about_us_image' => "/front/img/about_1.jpg",
        'about_us_image_2' => "/front/img/about_us_2.jpg",
        'postal_code' => "۴۸۳۱۱-۱۹۹۷۷",
        'footer_phone' => "۰۹۹۲۰۴۴۳۵۰۷ - ۰۹۹۲۰۴۴۳۵۰۷",
        'footer_working_time' => "هفت روز هفته (حتی روزهای تعطیل) ، ساعت ۹-۲۴ پاسخگوی شما هستیم.",

        'work_with_us_text' => "کافه یا رستوران هایی که تمایل دارند از امکان رزرو آنلاین میز با استفاده از تورمجازی بهره مند شوند بر روی دکمه زیر کلیک کنید تا از شرایط و مفاد همکاری مطلع شوید",
//        'work_with_us_image' => "/front/img/bg_call_section.jpg",
        'work_with_us_image' => "/front/img/contact_us_2.jpg",
        'work_with_us_banner_image' => "/front/img/contact_us_banner.jpeg",

        #Banner
        'advertise_banner_title' => "سامانه رزرواسیون بامیز",
        'advertise_banner_text' => "توضیخاتی بنر تبلیغاتی قرار گرفته در صفحه اصلی",
        'advertise_banner_link' => '/about-us',
        'advertise_banner_image' => "/front/img/banner_3.webp",

        # Social
        'email' => "bamiz.ir@gmail.com",
        'telegram' => "bamiz.ir",
        'whatsapp' => "https=>//wa.me/qr/bamiz.ir_watsapp",
        'twitter' => "bamiz.ir",
        'youtube' => "bamiz.ir",
        'instagram' => "bamiz.ir",
        'aparat' => "bamiz.ir",
        'facebook' => "bamiz.ir",
    ];

    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'init_settings {--clear}';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Init default settings';

    /**
     * Execute the console command.
     */
    public function handle()
    {
        if ($this->option('clear')) {
            DB::table('settings')->delete();
        }

        foreach (self::SETTINGS as $key => $value) {
            Setting::firstOrCreate(['key' => $key], ['value' => $value]);
        }

        $this->info("done, all settings synced...");
        return Command::SUCCESS;
    }
}
